{
  "products": [
    {
      "id": 5,
      "name": "Iphone 13 Pro Max",
      "price": 20000000,
      "categoryId": 1,
      "image": "http://res.cloudinary.com/chanh-thon/image/upload/v1669565936/upload_preset/drnrypjzdepu01am2jag.jpg",
      "introduce": "iPhone 13 Pro Max xứng đáng là một chiếc iPhone lớn nhất, mạnh mẽ nhất và có thời lượng pin dài nhất từ trước đến nay sẽ cho bạn trải nghiệm tuyệt vời, từ những tác vụ bình thường cho đến các ứng dụng chuyên nghiệp.",
      "desc": "<p class=\"ql-align-justify\"><a href=\"https://fptshop.com.vn/dien-thoai/iphone-13-pro-max\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"background-color: initial; color: rgb(1, 104, 250);\"><strong>iPhone 13 Pro Max</strong></a><strong style=\"background-color: initial;\">&nbsp;xứng đáng là một&nbsp;chiếc iPhone lớn nhất, mạnh mẽ nhất và có thời lượng pin dài nhất từ trước đến nay sẽ cho bạn trải nghiệm tuyệt vời, từ những tác vụ bình thường cho đến các ứng dụng chuyên nghiệp.</strong></p><p class=\"ql-align-center\"><strong style=\"background-color: initial;\"><img src=\"https://images.fpt.shop/unsafe/filters:quality(90)/fptshop.com.vn/Uploads/images/2015/Tin-Tuc/QuanLNH2/iphone-13-pro-max-2.jpg\" alt=\"Điện thoại iPhone 13 Pro Max 128GB\"></strong></p><h3 class=\"ql-align-justify\"><strong style=\"background-color: initial;\">Đắm chìm trong không gian màn hình lớn cực đã</strong></h3><p class=\"ql-align-justify\">Dù là giải trí khi xem phim, chơi game hay kiểm tra email, đọc tài liệu thì màn hình lớn tới 6,7 inch của iPhone 13 Pro Max cũng luôn cho trải nghiệm tuyệt vời nhất.</p><p class=\"ql-align-justify\">Không chỉ lớn, đây còn là màn hình chất lượng hàng đầu thế giới smartphone với tấm nền OLED tuyệt đẹp, công nghệ&nbsp;<a href=\"https://fptshop.com.vn/tin-tuc/tin-moi-1/super-retina-xdr-la-gi-cong-nghe-man-hinh-moi-tren-iphone-11-101690\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(1, 104, 250);\">Super Retina XDR</a>&nbsp;siêu nét và độ sáng tối đa đạt mức khó tin, lên tới 1200 nits cho nội dung HDR. Trước mắt bạn là một không gian giải trí mãn nhãn, một thiết bị di động lý tưởng để giải quyết nhanh công việc với màn hình thực sự xuất sắc.</p><p class=\"ql-align-center\"><span style=\"background-color: initial;\"><img src=\"https://images.fpt.shop/unsafe/filters:quality(90)/fptshop.com.vn/Uploads/images/2015/0511/iphone-13-pro-new-1.JPG\" alt=\"Đắm chìm trong không gian màn hình lớn iPhone 13 Pro Max\"></span></p><h3 class=\"ql-align-justify\"><strong style=\"background-color: initial;\">iPhone 13 Pro Max xanh lá sang trọng, bí ẩn</strong></h3><p class=\"ql-align-justify\">iPhone 13 Pro Max giờ đây đã khoác lên màu xanh lá Alpine Green bí ẩn mà không kém phần sang trọng. Sắc màu mới đem lại cảm nhận mới mẻ mà giúp bạn có thêm nhiều lựa chọn khi sắm sửa cho bản thân một chiếc iPhone cao cấp thế hệ mới. Cầm iPhone 13 Pro Max màu xanh lá&nbsp;trên tay, bạn sẽ có cảm giác như đang sử dụng phiên bản giới hạn của sản phẩm này.</p><p class=\"ql-align-center\"><span style=\"background-color: initial;\"><img src=\"https://images.fpt.shop/unsafe/filters:quality(90)/fptshop.com.vn/Uploads/images/2015/Tin-Tuc/BaoPK/SmartphoneChupDep/iphone-13-pro-max-xanh-la.jpg\" alt=\"iPhone 13 Pro Max màu xanh lá\"></span></p><h3 class=\"ql-align-justify\"><strong style=\"background-color: initial;\">Bước nhảy vọt về thời lượng pin</strong></h3><p class=\"ql-align-justify\">Dòng iPhone Pro Max luôn được người dùng yêu thích nhờ thời lượng pin siêu dài, tuy nhiên iPhone 13 Pro Max còn làm được nhiều hơn thế. Dung lượng pin lớn hơn, màn hình mới và bộ vi xử lý Apple A15 Bionic tiết kiệm điện hơn giúp nó&nbsp;trở thành chiếc&nbsp;<a href=\"https://fptshop.com.vn/dien-thoai/apple-iphone\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(1, 104, 250);\">iPhone</a>&nbsp;có thời lượng pin tốt nhất từ trước đến nay.</p><p class=\"ql-align-justify\">So với&nbsp;<a href=\"https://fptshop.com.vn/dien-thoai/iphone-12-pro-max\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(1, 104, 250);\">iPhone 12 Pro Max</a>, iPhone 13 Pro Max có thời gian sử dụng dài hơn 2,5 giờ. Bạn sẽ cảm nhận rõ sự khác biệt khi sử dụng thực tế, thời lượng pin iPhone 13 Pro Max thậm chí còn có thể kéo dài đến ngày thứ 3 với nhu cầu sử dụng thông thường.</p><p class=\"ql-align-center\"><span style=\"background-color: initial;\"><img src=\"https://images.fpt.shop/unsafe/filters:quality(90)/fptshop.com.vn/Uploads/images/2015/Tin-Tuc/QuanLNH2/iphone-13-pro-max-3.jpg\" alt=\"Bước nhảy vọt về thời lượng pin iPhone 13 Pro Max\"></span></p><h3 class=\"ql-align-justify\"><strong style=\"background-color: initial;\">Sang trọng, lịch lãm và quý phái</strong></h3>"
    },
    {
      "id": 6,
      "name": "Iphone 11 ",
      "price": 12000000,
      "categoryId": 1,
      "image": "http://res.cloudinary.com/dbo0o124i/image/upload/v1670345094/oa1l0m6zxxgm9cubellr.png",
      "introduce": "iPhone 11 với 6 phiên bản màu sắc, camera có khả năng chụp ảnh vượt trội, thời lượng pin cực dài và bộ vi xử lý mạnh nhất từ trước đến nay sẽ mang đến trải nghiệm tuyệt vời dành cho bạn.",
      "desc": "<p class=\"ql-align-justify\"><a href=\"https://fptshop.com.vn/dien-thoai/iphone-11-64gb\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"background-color: initial; color: rgb(1, 104, 250);\"><strong>iPhone 11</strong></a><strong style=\"background-color: initial;\">&nbsp;với 6 phiên bản màu sắc, camera có khả năng chụp ảnh vượt trội, thời lượng pin cực dài và bộ vi xử lý mạnh nhất từ trước đến nay sẽ mang đến trải nghiệm tuyệt vời dành cho bạn.</strong></p><p class=\"ql-align-center\"><strong style=\"background-color: initial;\"><img src=\"https://fptshop.com.vn/Uploads/images/2015/Tin-Tuc/QuanLNH2/iphone-11-1.jpg\" alt=\"Điện thoại iPhone 11 chính hãng\"></strong></p><h3 class=\"ql-align-justify\"><strong style=\"background-color: initial;\">Rực rỡ sắc màu, thể hiện cá tính</strong></h3><p class=\"ql-align-justify\">Có tới 6 sự lựa chọn màu sắc cho iPhone 11 64GB, bao gồm Tím, Vàng, Xanh lục, Đen, Trắng và Đỏ, tha hồ để bạn lựa chọn màu phù hợp với sở thích, cá tính riêng của bản thân. Vẻ đẹp của iPhone 11 đến từ thiết kế cao cấp khi được làm từ khung nhôm nguyên khối và mặt lưng liền lạc với một tấm kính duy nhất. Ở mặt trước, bạn sẽ được chiêm ngưỡng màn hình Liquid Retina lớn 6,1 inch, màu sắc vô cùng chân thực. Tất cả tạo nên chiếc&nbsp;<a href=\"https://fptshop.com.vn/dien-thoai\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(1, 104, 250);\">điện thoại</a>&nbsp;tràn đầy hứng khởi.</p><p class=\"ql-align-center\"><span style=\"background-color: initial;\"><img src=\"https://fptshop.com.vn/Uploads/images/2015/Tin-Tuc/QuanLNH2/iphone-11-2.jpg\" alt=\"Rực rỡ sắc màu, thể hiện cá tính | iPhone 11\"></span></p><h3 class=\"ql-align-justify\"><strong style=\"background-color: initial;\">Hệ thống camera kép mới</strong></h3><p class=\"ql-align-justify\">Apple iPhone 11 sở hữu cụm camera kép mặt sau, bao gồm camera góc rộng và camera góc siêu rộng. Cảm biến camera góc rộng 12MP có khả năng lấy nét tự động nhanh gấp 3 lần trong điều kiện thiếu sáng. Bên cạnh đó cảm biến góc siêu rộng cho khả năng chụp cảnh rộng gấp 4 lần, là phương tiện ghi hình tuyệt vời cho những chuyến du lịch, chụp hình nhóm. Nhanh chóng chụp ảnh, quay video, chỉnh sửa và chia sẻ ngay trên&nbsp;<a href=\"https://fptshop.com.vn/dien-thoai/apple-iphone\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(1, 104, 250);\">iPhone</a>, bạn sẽ không bỏ lỡ bất cứ khoảnh khắc đáng nhớ nào.</p><p class=\"ql-align-center\"><span style=\"background-color: initial;\"><img src=\"https://fptshop.com.vn/Uploads/images/2015/Tin-Tuc/QuanLNH2/iphone-11-3.jpg\" alt=\"Hệ thống camera kép mới | iPhone 11\"></span></p><h3 class=\"ql-align-justify\"><strong style=\"background-color: initial;\">Quay video chưa bao giờ chuyên nghiệp đến thế</strong></h3><p class=\"ql-align-justify\">Điện thoại iPhone 11 64GB có khả năng quay những đoạn video tuyệt đẹp với độ phân giải 4K 60fps siêu sắc nét. Camera góc siêu rộng mang đến nhiều khung cảnh hơn, đồng thời khả năng quay chuyển động cực ấn tượng sẽ tạo nên những thước phim hoàn hảo. Ngoài ra bạn còn có thể tập trung thu âm vào một chủ thể khi quay video bằng cách phóng to, zoom hình ảnh – đồng thời zoom âm thanh hết sức thú vị. Tất nhiên sau khi quay video, việc chỉnh sửa và xuất bản sẽ diễn ra hết sức tiện lợi, nhanh chóng trên iPhone 11.</p><p class=\"ql-align-center\"><span style=\"background-color: initial;\"><img src=\"https://fptshop.com.vn/Uploads/images/2015/Tin-Tuc/QuanLNH2/iphone-11-4.jpg\" alt=\"Quay video trên iPhone 11\"></span></p><h3 class=\"ql-align-justify\"><strong style=\"background-color: initial;\">Night Mode, chuyên gia chụp ảnh thiếu sáng</strong></h3><p class=\"ql-align-justify\">Chụp ảnh thiếu sáng không còn là vấn đề trên iPhone 11. Với chế độ chụp đêm chuyên dụng Night Mode hoàn toàn mới, máy ảnh sẽ nhìn thấy rõ ràng từng chi tiết trong đêm tối. Không cần phải bật đèn flash, hình ảnh vẫn trở nên sống động nhờ ánh sáng tự nhiên, màu sắc chính xác và chất ảnh sáng rõ.</p><p class=\"ql-align-center\"><span style=\"background-color: initial;\"><img src=\"https://fptshop.com.vn/Uploads/images/2015/Tin-Tuc/QuanLNH2/iphone-11-5.jpg\" alt=\"Night Mode, chuyên gia chụp ảnh thiếu sáng | iPhone 11\"></span></p><p><br></p>"
    },
    {
      "id": 7,
      "name": "Iphone 14 Pro Max",
      "price": 32000000,
      "categoryId": 1,
      "image": "http://res.cloudinary.com/dbo0o124i/image/upload/v1670345288/gunhxgofloxm0zqoluwk.png",
      "introduce": "iPhone 14 Pro Max VN/A là dòng sản phẩm cao cấp nhất nằm trong thế hệ iPhone 14 Series mới vừa được ra mắt cùng với nhiều nâng cấp về ngoại hình và tính năng, hứa hẹn sẽ là dòng sản phẩm đột phá trong vài năm trở lại đây của Apple.",
      "desc": "<p><br></p><p class=\"ql-align-justify\"><img src=\"https://admin.hoanghamobile.com/Uploads/2022/10/05/11.jpg\"></p><p class=\"ql-align-justify\"><br></p><p class=\"ql-align-center\"><em>iPhone 14 Pro Max VN/A</em></p><h2 class=\"ql-align-justify\">Phá vỡ thiết kế notch cổ điển</h2><p class=\"ql-align-justify\">Chiếc iPhone 14 Pro Max VN/A sở hữu màn hình Super Retina XDR mới với ProMotion có kích thước 6.7 inch. Tần số quét màn hình sẽ giảm xuống 1 Hz để tiết kiệm pin, trong khi hình nền được làm mờ. Màn hình tiên tiến cũng mang lại mức độ sáng HDR cao nhất tương tự như Pro Display XDR và ​​độ sáng đỉnh ngoài trời cao nhất trong điện thoại thông minh: lên đến 2000 nits, sáng gấp đôi so với người tiền nhiệm.</p><p class=\"ql-align-justify\">Màn hình trước làm từ chất liệu Ceramic Shield - cứng hơn bất kỳ loại kính điện thoại thông minh nào - và được bảo vệ khỏi các sự cố tràn và tai nạn thông thường với khả năng chống nước và bụi.</p><p class=\"ql-align-justify\">Màn hình Dynamic Island mới trên dòng iPhone 14 Pro được coi là ý tưởng thiết kế sáng tạo, đem đến trải nghiệm độc đáo. Apple đã thay thế phần notch trên dòng sản phẩm ‌iPhone 14 Pro‌ bằng lỗ khuyết viên thuốc và đục lỗ. Một chi tiết mới quan trọng của việc thay thế notch xuất hiện trong tuần này là khi thiết bị được sử dụng, các lỗ hình viên thuốc và lỗ đục lỗ sẽ hợp nhất bằng kỹ thuật số thành hình chữ i dài hơn. Phần cắt này được Apple dùng để hiển thị thông tin như các thông báo về quyền riêng tư của iOS và cụm cảm biến cho FaceID</p><p class=\"ql-align-justify\">Ngoài ra, iPhone 14 Pro Max VN/A còn có tính năng Always On Display hay màn hình luôn bật, đây là một trong những tính năng khá thú vị trên các dòng điện thoại hiện nay. Tính năng này không chỉ giúp bạn nhận được thông báo từ các ứng dụng như đồng hồ, lịch, tin nhắn, cuộc gọi nhỡ, ứng dụng,... kể cả khi màn hình điện thoại đã tắt mà còn giúp điện thoại tiết kiệm pin đáng kể.</p><h2 class=\"ql-align-justify\">Nâng cấp đáng kể về camera</h2><p class=\"ql-align-justify\">Một trong những nâng cấp mà người dùng trông đợi nhất từ dòng iPhone 14 đó chính là camera. Sau nhiều năm camera dặm chân ở con số 12MP, độ phân giải camera chính của iPhone 14 Pro Max VN/A đã được nâng cấp lên thành 48MP cùng điểm ảnh 1,4µm. Sự nâng cấp này cho phép camera thu được nhiều ánh sáng hơn khi chụp ảnh trong điều kiện ánh sáng yếu.</p><p class=\"ql-align-justify\"><img src=\"https://admin.hoanghamobile.com/Uploads/2022/10/05/22.jpg\"></p><p class=\"ql-align-justify\"><br></p><p class=\"ql-align-center\"><em>iPhone 14 Pro Max VN/A có nâng cấp đáng kể về camera</em></p><p class=\"ql-align-justify\">&nbsp;</p><p class=\"ql-align-justify\">Ngoài ra, điện thoại còn hỗ trợ quay video 8K (ở tốc độ lên đến 60 khung hình/giây), không chỉ đem lại hình ảnh sắc nét hơn (như tăng chất lượng trên video YouTube) mà còn cho phép các nhà làm phim cắt, ổn định và điều chỉnh lại cảnh quay sau khi nó được quay.</p><p class=\"ql-align-justify\">●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Máy ảnh chính được nâng cấp lên thành 48MP cùng điểm ảnh 1,4µm, đi kèm pixel-binning (kết hợp pixel với nhau) cho phép camera thu được nhiều ánh sáng hơn và giảm nhiễu</p><p class=\"ql-align-justify\">●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Máy ảnh 12MP Ultra Wide mới với điểm ảnh 1,4 µm pixel, mang lại hình ảnh sắc nét hơn với nhiều chi tiết hơn, cải thiện khả năng chụp ảnh macro vốn đã mạnh mẽ.</p><p class=\"ql-align-justify\">●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Máy ảnh tele cải tiến có khả năng zoom quang học 3x.</p><p class=\"ql-align-justify\">●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Một camera TrueDepth phía trước mới với khẩu độ ƒ / 1.9 cho phép chụp ảnh và quay video trong điều kiện ánh sáng yếu tốt hơn. Sử dụng lấy nét tự động lần đầu tiên, nó có thể lấy nét nhanh hơn nữa trong điều kiện ánh sáng yếu và chụp ảnh nhóm từ xa hơn.</p><p class=\"ql-align-justify\">●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Đèn flash True Tone thích ứng mới đã được thiết kế lại hoàn toàn với một dãy chín đèn LED thay đổi kiểu dựa trên độ dài tiêu cự đã chọn.</p><p class=\"ql-align-justify\">●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Hỗ trợ chụp ảnh tiên tiến như Chế độ ban đêm, Smart HDR 4, Chế độ chân dung với Ánh sáng chân dung, Chế độ ban đêm Ảnh chân dung, Kiểu chụp ảnh để cá nhân hóa giao diện của mọi bức ảnh và Apple ProRAW.</p><p class=\"ql-align-justify\">●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Chế độ Action mới cho video trông cực kỳ mượt mà có thể giảm độ rung, cho ra những khung hình mượt mà sống động</p><p class=\"ql-align-justify\">●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Chế độ Cinematic, hiện có sẵn ở 4K ở tốc độ 30 khung hình / giây và 4K ở tốc độ 24 khung hình / giây.</p><p class=\"ql-align-justify\">●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Tính năng định dạng video chuyên nghiệp, bao gồm ProRes3 và Dolby Vision HDR đầu cuối.</p><h2 class=\"ql-align-justify\">Bộ vi xử lý A16 cực xịn</h2><p class=\"ql-align-justify\">iPhone 14 Pro Max VN/A sử dụng bộ vi xử lý Apple A16 Bionic được xử lý trên tiến trình 4nm. Với bộ xử lý neural 16 nhân trên chip này, bên cạnh bộ xử lý màn hình hoàn toàn mới để hỗ trợ đẩy tần số quét xuống 1Hz, xử lý tính năng always-on và giúp Dynamic Island hoạt động mượt mà.Thiết bị có RAM 6GB sử dụng công nghệ LPDDR5 cải tiến về tốc độ truyền và điện năng tiêu thụ.</p><p class=\"ql-align-justify\"><img src=\"https://admin.hoanghamobile.com/Uploads/2022/10/05/33.jpg\"></p><p class=\"ql-align-center\"><em>iPhone 14 Pro Max VN/A</em></p><p><br></p><p><br></p>"
    },
    {
      "id": 8,
      "name": "Samsung Galaxy S22 Plus",
      "price": 20000000,
      "categoryId": 3,
      "image": "http://res.cloudinary.com/dbo0o124i/image/upload/v1670345365/lgh4gq3jo00dzcirpofp.png",
      "introduce": "Galaxy S22 series đã chính thức được Samsung trình làng với ba phiên bản khác nhau. Trong đó, Galaxy S22 Plus gây ấn tượng với thiết kế và cấu hình được nâng cấp vượt trội, đáp ứng sự mong đợi của người dùng.",
      "desc": "<h3>Thiết kế sang trọng, nhiều màu sắc trẻ trung</h3><p class=\"ql-align-justify\"><br></p><p class=\"ql-align-justify\">Thiết kế của Galaxy S22 Plus không thay đổi quá nhiều so với Galaxy S21 Plus. Khung viền máy vẫn được bo tròn bốn góc đúng theo phong cách dòng S. Màn hình Infinity-O phía trước có một lỗ đục nhỏ dành cho camera selfie. Mặt lưng của máy đã được chuyển sang chất liệu kính thay thay vì nhựa như thế hệ trước. Đặc biệt, phần mặt lưng này cũng được vát phẳng mang lại cảm giác cầm chắc chắn hơn.</p><p class=\"ql-align-justify\">Cụm camera vẫn là điểm nhấn nổi bật nhất ở phía sau. Mặc dù thiết kế camera không đổi nhưng cách phối màu lại tương đồng với màu máy hơn. Với sự thay đổi này sẽ thật khó để tìm được điểm chê trên thiết kế này. Ngoài ra, máy còn có bốn phiên bản màu sắc trẻ trung bao gồm Trắng Phantom, Xanh Zeta, Hồng Blossom và Đen Phantom.</p><p class=\"ql-align-center\"><img src=\"https://cdn.hoanghamobile.com/i/content/Uploads/2022/02/17/galaxy-s22-plus.png\"></p><p class=\"ql-align-justify\"><br></p><h3>Màn hình Dynamic AMOLED 2X 120Hz mượt mà</h3><p class=\"ql-align-justify\"><br></p><p class=\"ql-align-justify\">Galaxy S22 Plus được trang bị tấm nền Dynamic AMOLED 2X, độ phân giải Full HD+. Tần số quét 120Hz tiếp tục được Samsung đưa lên sản phẩm này nhằm mang đến trải nghiệm mượt mà nhất cho người dùng. Tần số quét cao cũng mang tới khả năng hiển thị sắc nét và độ sáng tuyệt vời khi xem video, chơi game.</p><p class=\"ql-align-justify\">Màn hình được bảo vệ bởi kính cường lực Gorilla Glass Victus+. Đây là dòng kính cường lực cao cấp nhất giúp Galaxy S22 Plus chống va đập hiệu quả. Ngoài ra, máy còn có khả năng kháng bụi và kháng khuẩn chuẩn IP68.</p><p class=\"ql-align-center\"><img src=\"https://cdn.hoanghamobile.com/i/content/Uploads/2022/02/17/galaxy-s22-plus-2.png\"></p><p class=\"ql-align-justify\"><br></p><h3>Hệ thống camera nâng cấp, nhiếp ảnh ấn tượng</h3><p class=\"ql-align-justify\"><br></p><p class=\"ql-align-justify\">Galaxy S22 Plus sở hữu bộ ba camera với camera chính 50MP mở rộng tầm nhìn tối đa, camera góc siêu rộng 12MP cùng cảm biến siêu nhạy sáng và camera tele 10MP thu phóng quang học 3x. Những nâng cấp về cảm biến cũng như thuật toán xử lý ảnh mà Samsung trang bị cho chiếc smartphone này chắc chắn sẽ mang lại những bức ảnh có chất lượng cao.</p><p class=\"ql-align-justify\">Galaxy S22 Plus không chỉ sở hữu cảm biến điểm ảnh lớn mà còn có lớp kính siêu trong giảm lóe giúp chụp ảnh đêm ấn tượng.Tính năng Tốc độ khung hình tự động cùng Giải pháp Siêu Chụp đêm hỗ trợ giảm nhiễu trên từng khung hình mang đến những thước phim mãn nhãn.</p><p class=\"ql-align-center\"><img src=\"https://cdn.hoanghamobile.com/i/content/Uploads/2022/02/17/galaxy-s22-plus-3.png\"></p><p class=\"ql-align-justify\"><br></p><h3>Vi xử lý Snapdragon 8 Gen 1 hiệu năng mạnh mẽ hàng đầu</h3><p class=\"ql-align-justify\"><br></p><p class=\"ql-align-justify\">Khác với mọi năm, Samsung thường sử dụng dòng chip Exynos cho dòng flagship Galaxy S, nhưng năm nay đã thay bằng Snapdragon 8 Gen 1. Vì được sản xuất trên tiến trình 4nm tiên tiến nên con chip này sẽ mang đến hiệu năng vượt trội. Đi kèm với đó là dung lượng RAM 8GB và hai lựa chọn bộ nhớ trong 128GB và 256GB. Vậy nên người dùng có thể thoải mái lưu trữ dữ liệu, hình ảnh, video.</p><p class=\"ql-align-center\"><img src=\"https://cdn.hoanghamobile.com/i/content/Uploads/2022/02/17/galaxy-s22-plus-4.png\"></p><p class=\"ql-align-justify\"><br></p><h3>Dung lượng pin 4500mAh, hỗ trợ sạc nhanh 45W</h3><p class=\"ql-align-justify\"><br></p><p class=\"ql-align-justify\">Samsung đã trang bị cho Galaxy S22 Plus viên pin 4500mAh và tích hợp sạc nhanh lên tới 45W. Nhờ đó, người dùng có thể sử dụng trong cả ngày dài và sạc đầy pin nhanh chóng. Ngoài ra, máy còn có công nghệ pin thông minh thích ứng với từng hoạt động để tối ưu thời gian sử dụng tới 24 giờ. Đặc biệt, chiếc smartphone này còn có thể sạc không dây cho thiết bị khác.</p><p><br></p>"
    },
    {
      "id": 9,
      "name": "Xiaomi 12T Pro",
      "price": 15000000,
      "categoryId": 5,
      "image": "http://res.cloudinary.com/dbo0o124i/image/upload/v1670345441/r28rtsjnqx5dthrmu91z.png",
      "introduce": "Xiaomi đã phá vỡ rào cản 200MP với điện thoại thông minh mới nhất của mình, Xiaomi 12T Pro. Snapdragon 8 Gen 1 mạnh mẽ cũng là điểm nhấn trên smartphone này.",
      "desc": "<p class=\"ql-align-justify\">Xiaomi đã phá vỡ rào cản 200MP với điện thoại thông minh mới nhất của mình, Xiaomi 12T Pro. Snapdragon 8 Gen 1 mạnh mẽ cũng là điểm nhấn trên smartphone này.</p><p class=\"ql-align-justify\"><img src=\"https://cdn.hoanghamobile.com/i/content/Uploads/2022/10/06/11_638006647278916041.png\"></p><p class=\"ql-align-justify\"><br></p><p class=\"ql-align-justify\"><br></p><p class=\"ql-align-center\"><em>Xiaomi 12T Pro</em></p><h2 class=\"ql-align-justify\"><strong>Thiết kế tương đồng với Xiaomi 12 Pro</strong></h2><p class=\"ql-align-justify\">Thoạt nhìn bề ngoài, Xiaomi 12T Pro có ngoại hình nhiều nét tương tự với Xiaomi 12 Pro. Nó có mặt sau bằng kính mờ cong. Bốn góc của thiết bị bo cong sang nhẹ giúp thiết kế trở nên mềm mại, thanh thoát và cảm giác cầm vừa tay hơn, bám tay hơn. Điện thoại có kích thước 163.6 x 74.6 x 8.2 mm, nặng 204g, một kích thước và khối lượng vừa đủ, không quá cồng kềnh nhưng cũng không quá gọn nhẹ.</p><p class=\"ql-align-justify\">Màn hình của thiết bị là màn hình AMOLED 6,67 inch 120Hz tỉ lệ khung hình 20:9, có thể tăng mức độ sáng lên 900 nits trong các điều kiện thiếu sáng. Ngoài ra chiếc màn hình này còn được trang bị hàng loạt các công nghệ như: 1B colors, 120Hz, Dolby Vision, HDR10+.</p><p class=\"ql-align-justify\">Sản phẩm gồm 3 tuỳ chọn màu sắc là đen, bạc và xanh.</p><h2 class=\"ql-align-justify\"><strong>Camera có độ phân giải khủng lên đến 200MP</strong></h2><p class=\"ql-align-justify\">Điểm nổi bật chính của chiếc 12T Pro chính là thiết lập camera phía sau. Xiaomi đang sử dụng cảm biến ISOCELL HP1 1/1.2, độ phân giải 200MP, kích thước điểm ảnh 0,64µm với khẩu độ f/1.69 và ống kính 8P cho camera chính. Isocell HP1 là cảm biến ảnh đầu tiên cho smartphone có độ phân giải 200MP với khả năng gộp 16 điểm ảnh để thu sáng tốt hơn (mỗi điểm ảnh có kích thước 0,64 μm), mang lại kích thước pixel tương đương 1,28µm khi quay video 8K.</p><p class=\"ql-align-justify\">Ngoài ra, cụm máy ảnh này bao gồm ba mô-đun ống kính khác. Nó có một camera siêu rộng 8MP với ống kính F2.2 trường nhìn 120 °, một camera macro 2MP và một camera selfie phía trước 20MP. Màn hình phía trước cũng bao gồm một cảm biến vân tay quang học</p><p class=\"ql-align-justify\">Đối với chụp ảnh thiếu sáng, camera điện thoại cũng có chế độ ghép ảnh 16 đến 1 pixel giúp tăng kích thước điểm ảnh hiệu dụng lên 2,56µm. Cảm biến này cũng tích hợp công nghệ ISO thông minh của Samsung, một chế độ tăng cường kép để có được chất lượng hình ảnh tốt nhất có thể, cho dù bạn đang chụp ban ngày hay ban đêm. Máy ảnh cũng bao gồm Ổn định hình ảnh quang học (OIS).</p><p class=\"ql-align-justify\"><img src=\"https://cdn.hoanghamobile.com/i/content/Uploads/2022/10/06/22_638006647278916041.jpg\"></p><p class=\"ql-align-justify\"><br></p><p class=\"ql-align-center\"><em>Xiaomi 12T Pro sử dụng cảm biến ISOCELL HP1 1/1.2 200MP</em></p><p class=\"ql-align-justify\">Tuy nhiên, Xiaomi 12T Pro không bao gồm ống kính tele tích hợp. Tuy nhiên, nhờ cảm biến hình ảnh 200MP, có khả năng thu phóng kỹ thuật số không mất dữ liệu gấp 2 lần.Với khả năng và độ phân giải của ISOCELL HP1, không có gì ngạc nhiên khi điện thoại hỗ trợ quay video 8K và có thể quay cảnh HDR10 +. Điện thoại cũng có các “trợ lý sáng tạo” với Xiaomi ProCut và Ultra burst - trình cắt ảnh thông minh và tạo nội dung chuyên nghiệp.</p><h2 class=\"ql-align-justify\"><strong>Bộ vi xử lý Snapdragon 8+ Gen 1 mạnh mẽ</strong></h2><p class=\"ql-align-justify\">Xiaomi 12T Pro sử dụng bộ vi xử lý Snapdragon 8+ Gen 1 được sản xuất trên tiến trình 4nm đầu tiên của Qualcomm và là bộ vi xử lý đầu tiên sử dụng thế hệ kiến ​​trúc CPU mới này. Chip này thường được dùng trên các dòng máy cao cấp đáp ứng tốt mọi nhu cầu từ làm việc cho đến giải trí với các tựa game nặng. Ngoài ra điện thoại cũng sở hữu 12GB RAM, 256GB bộ nhớ giúp bạn thoải mái chạy đa nhiệm và lưu trữ dữ liệu.</p><p class=\"ql-align-center\"><img src=\"https://cdn.hoanghamobile.com/i/content/Uploads/2022/10/06/33_638006647278916041.jpg\"><em>Xiaomi 12T Pro vận hành bằng Snapdragon 8+ Gen 1</em></p><p class=\"ql-align-justify\">Ngoài ra, thiết bị cũng được trang bị hệ thống tản nhiệt bao gồm một khoang chứa hơi lớn hơn 65%, giúp không chỉ có thể tải những ứng dụng nặng mà còn không bị nóng máy.</p><p class=\"ql-align-justify\">Cung cấp năng lượng cho điện thoại là pin có dung lượng 5.000mAh và hỗ trợ sạc nhanh 120W HyperCharge siêu nhanh. Nếu sử dụng bộ sạc đi kèm, bạn có thể sạc đầy pin trong vòng chưa đầy 20 phút. Không những vậy, máy còn được tích hợp tính năng Xiaomi Adaptive Charge cho phép theo dõi thói quen sạc hàng ngày của người dùng nhằm tối ưu hóa tuổi thọ pin.</p><p><br></p>"
    },
    {
      "id": 10,
      "name": "Laptop MacBook Pro 14 M1 Pro 2021",
      "price": 42000000,
      "categoryId": 2,
      "image": "http://res.cloudinary.com/dbo0o124i/image/upload/v1670344326/cwyp6ier7jxgnrpcwaln.jpg",
      "introduce": "   Một trong những chiếc laptop được mong đợi nhất trong năm 2021 chắc chắn không thể bỏ qua em laptop Macbook Pro 16\" 2021 - M1 Max 32 Core GPU/1TB của nhà Apple. Hãy cùng Hoàng Hà Mobile tìm hiểu thêm thông tin chi tiết về dòng laptop này dưới đây nhé!",
      "desc": "<p class=\"ql-align-justify\">Một trong những chiếc laptop được mong đợi nhất trong năm 2021 chắc chắn không thể bỏ qua em laptop Macbook Pro 16\" 2021 - M1 Max 32 Core GPU/1TB của nhà Apple. Hãy cùng Hoàng Hà Mobile tìm hiểu thêm thông tin chi tiết về dòng laptop này dưới đây nhé!</p><p class=\"ql-align-center\"><img src=\"https://cdn.hoanghamobile.com/i/content/Uploads/2022/01/07/macbook-pro-16-22-2021.png\"></p><p class=\"ql-align-justify\"><br></p><h3>Thiết kế hiện đại từ nhôm tái chế, bảo vệ môi trường cùng Magic Keyboard độ nảy cực cao</h3><p class=\"ql-align-justify\">&nbsp;</p><p class=\"ql-align-justify\">Macbook Pro 16\" 2021 sở hữu ngoại hình nổi bật, tinh tế, hiện đại đến từng chi tiết. Lớp vỏ máy được làm từ kim loại nguyên khối bằng nhôm tái chế thân thiện với môi trường, bền bỉ theo thời gian. Dù có trọng lượng 2.2kg với độ dày 16.8 mm nhưng em laptop này vẫn giữ được thiết kế gọn gàng mà không hề hầm hố.</p><p class=\"ql-align-justify\">&nbsp;</p><p class=\"ql-align-justify\">Bàn phím Magic Keyboard là một trong những điểm cộng của Macbook Pro 16\" 2021 với hành trình phím sâu, độ nảy cao giúp người dùng sử dụng thoải mái, ngay cả khi phải thao tác đánh máy trong thời gian dài. Ngoài ra, bàn phím cũng được trang bị đèn nền, giúp người dùng sử dụng dễ dàng trong điều kiện thiếu sáng hay vào buổi tối.</p><p class=\"ql-align-center\"><img src=\"https://cdn.hoanghamobile.com/i/content/Uploads/2022/01/07/macbook-pro-16-22-2021-2.png\">&nbsp;</p><p class=\"ql-align-justify\">Một trong những điểm mới ở đây là bàn phím lần đầu tiên được tích hợp một hàng phím chức năng F bao gồm: Spotlight, Siri, Dictation và Do Not Disturb giúp bạn thực hiện các phím tắt/mở nhanh chóng và dễ dàng hơn bao giờ hết.</p><p class=\"ql-align-justify\">&nbsp;</p><p class=\"ql-align-justify\">Dòng laptop này cũng được trang bị bảo mật vân tay an toàn tuyệt đối, giúp người dùng mở máy nhanh chóng, thanh toán online thuận tiện, bảo mật thông tin tốt hơn. Bên cạnh đó, máy cũng được trang bị đầy đủ các cổng kết nối như HDMI, Jack cắm tai nghe 3.5 mm, 3 cổng Thunderbolt 4 và sạc nhanh bằng cổng MagSafe 3 thuận tiện.</p><p class=\"ql-align-justify\">Chưa hết đâu, kết nối không dây Bluetooth 5.0 và Wi-Fi 6 (802.11ax) cho băng tần cao 9.6 Gbps, với tốc độ tăng 40% cũng giúp người dùng có thể xem được các video ở độ phân giải lên đến 4K mượt mà.</p><p class=\"ql-align-justify\">&nbsp;</p><h3>Hiệu năng vượt trội với chip Apple M1 Max cùng ổ cứng dung lượng lên đến 1TB</h3><p class=\"ql-align-justify\">&nbsp;</p><p class=\"ql-align-justify\">Macbook Pro 16\" 2021 sở hữu con chip Apple M1 Max với cấu trúc 10 nhân cùng tốc độ băng thông 400 GB/s memory bandwidth đem đến khả năng xử lý các tác vụ văn phòng, hình ảnh, video cực mượt. Thậm chí hiệu năng của em laptop này còn nhanh hơn khoảng 70% so với thế hệ tiền nhiệm Apple M1 nữa.</p><p class=\"ql-align-justify\">&nbsp;</p><p class=\"ql-align-justify\">Cùng với con chip cực mạnh, Macbook Pro 16\" 2021 sở hữu card đồ họa GPU 32 nhân cho hiệu suất nhanh hơn gấp 4 lần so với Apple M1. Với card đồ họa này, người dùng thoải mái thực hiện việc xử lý hình ảnh 2D, 3D, edit video cực mượt mà vẫn tiết kiệm được điện năng.</p><p class=\"ql-align-justify\">&nbsp;</p><p class=\"ql-align-justify\">Chưa hết đâu, dung lượng khủng SSD 1TB cùng bộ nhớ RAM 32GB cũng mang đến không gian bộ nhớ rộng rãi, thoải mái cho bạn lưu trữ tài liệu cá nhân như hình ảnh, video, các bộ phim yêu thích. Đồng thời cho khả năng mở nhiều tab và ứng dụng cùng một lúc mà không lo giật, lag máy.</p><p class=\"ql-align-justify\"><br></p><p class=\"ql-align-center\">&nbsp;<img src=\"https://cdn.hoanghamobile.com/i/content/Uploads/2022/01/07/macbook-pro-16-22-2021-3.png\"></p><p class=\"ql-align-justify\">Ngoài ra, hệ thống tản nhiệt tiên tiến cũng chính là điểm cộng to lớn cho dòng laptop này với khả năng chuyển lưu không khí nhiều hơn 50% giúp máy luôn mát mẻ, ổn định dù cho có hoạt động trong một thời gian dài.</p><p class=\"ql-align-justify\">&nbsp;</p><h3>Màn hình 16.2 inch siêu mỏng, sắc nét cùng dải màu Wide color với 1 tỷ màu sắc nét độc đáo</h3><p class=\"ql-align-justify\">&nbsp;</p><p class=\"ql-align-justify\">Cũng giống như phiên bản 14 inch, Macbook Pro 16\" 2021 cũng sở hữu thiết kế tai thỏ cùng tần số quét màn hình 120Hz. Thêm vào đó, máy cũng tấm nền Liquid Retina XDR display có độ phân giải cải tiến hơn phiên bản 14 inch với 3456 x 2234 pixel.&nbsp;</p><p class=\"ql-align-justify\">&nbsp;</p><p class=\"ql-align-justify\">Với dải màu&nbsp;Wide color (P3) với 1 tỷ màu sắc giúp Macbook Pro 16\" 2021 sở hữu màn hình với màu sắc cực đỉnh, sắc nét đến từng chi tiết. Thêm vào đó, công nghệ True Tone tự động điều chỉnh màu sắc và độ sáng sao cho phù hợp với môi trường đang sử dụng, đảm bảo chất lượng hình ảnh luôn hiển thị chính xác, chân thực nhất đến với người dùng.</p><p class=\"ql-align-justify\">&nbsp;</p><p class=\"ql-align-justify\">Macbook Pro 16\" 2021 sở hữu hệ thống âm thanh 6 loa bao gồm 4 loa trầm cho âm thanh sâu sắc hơn với âm trầm nhiều hơn tới 80% và 2 loa tweeter hiệu suất cao phát ra âm thanh rõ ràng, sống động. Chưa hết đâu, công nghệ Dolby Atmos kết hợp cùng Wide stereo sound sẽ giúp người dùng thưởng thức âm nhạc, bộ phim yêu thích một cách trọn vẹn nhất.</p><p class=\"ql-align-justify\"><br></p><p class=\"ql-align-center\">&nbsp;<img src=\"https://cdn.hoanghamobile.com/i/content/Uploads/2022/01/07/macbook-pro-16-22-2021-4.png\"></p><p class=\"ql-align-justify\">Ngoài ra, người dùng có thể thoải mái thực hiện các cuộc gọi Facetime, họp online, học trực tuyến qua Zoom, Google Meet,... dễ dàng với camera FaceTime HD camera độ phân giải 1080p. Cùng với đó là sự hỗ trợ của 3 micro với độ ồn thấp hơn tới 60%, định hướng chùm tia để giọng nói của bạn luôn to và rõ ràng.</p><p class=\"ql-align-justify\">&nbsp;</p><p class=\"ql-align-justify\">Đặt mua tại Hoàng Hà Mobile để nhận được mức giá tốt nhất và cam kết về chất lượng sản phẩm.</p><p class=\"ql-align-justify\">&nbsp;</p><p><br></p>"
    },
    {
      "name": "Macbook Pro M2 13\" 2022",
      "price": 30000000,
      "categoryId": 2,
      "image": "http://res.cloudinary.com/dbo0o124i/image/upload/v1670345572/ebrthzw5yauxqj8hbz4m.png",
      "introduce": "Trong tháng 6 vừa qua, Apple đã giới thiệu con chip độc quyền thế hệ thứ hai. Chip M2 được trang bị trên cả hai dòng sản phẩm MacBook Air và MacBook Pro. Nó hứa hẹn sẽ là một phiên bản nâng cấp mạnh mẽ so với thế hệ MacBook Pro M1. Nếu bạn đang tìm kiếm một chiếc máy tính nhỏ gọn với hiệu năng vượt trội thì chắc chắn không thể bỏ qua MacBook Pro M2 13 inch 2022 256GB chính hãng Apple Việt Nam",
      "desc": "<h3 class=\"ql-align-justify\">Thiết kế mỏng hơn, sang trọng hơn</h3><p class=\"ql-align-justify\">MacBook Pro là dòng sản phẩm máy tính cao cấp của nhà Apple. Đối với phiên bản năm 2022, nhà sản xuất không thay đổi nhiều về thiết kế bên ngoài. Máy được hoàn thiện với lớp vỏ kim loại nguyên khối và bộ khung phẳng. Trọng lượng của máy chỉ khoảng 1.4kg và độ dày là 15.6mm. Nhờ đó MacBook Pro M2 phiên bản mới trông sang trọng, thời thượng hơn mà vẫn vô cùng tiện lợi khi có thể có thể bỏ vào túi, cặp xách và mang theo di chuyển dễ dàng.</p><p class=\"ql-align-justify\"><br></p><p class=\"ql-align-center\">&nbsp;<img src=\"https://cdn.hoanghamobile.com/i/content/Uploads/2022/06/28/pro-m2-13-2.png\"></p><p class=\"ql-align-justify\">Ngoài ra, MacBook Pro M2 13 inch 2022 256GB chính hãng còn được trang bị bàn phím Magic Keyboard đã được cải tiến mang đến trải nghiệm soạn thảo dễ dàng, thoải mái. Apple vẫn giữ lại thanh Touch Bar để người dùng có thể thao tác với các phím tắt nhanh chóng. Bên dưới bàn phím có đèn nền để hỗ trợ người dùng khi làm việc trong các điều kiện thiếu sáng. Cũng như thế hệ trước, bàn phím có phần mở khóa bằng Touch ID giúp người dùng tiết kiệm thời gian và có thể quay lại công việc trong chớp mắt.</p><h3 class=\"ql-align-justify\">Tốc độ xử lý ấn tượng từ chip M2, bộ nhớ lưu trữ 256GB</h3><p class=\"ql-align-justify\">Không chỉ có diện mạo ấn tượng, sức mạnh bên trong của chiếc MacBook Pro M2 13 inch 2022 256GB chính hãng không thua kém bất kỳ đối thủ nào trên thị trường. Chip M2 mới có tốc độ xử lý nhanh hơn 1.4 lần so với chip M1 nhờ CPU 8 nhân và GPU 10 lõi. Nhờ đó máy có thể xử lý các hình ảnh đồ họa, video 4K hay 8K định dạng ProRes một cách chuyên nghiệp, mượt mà vô cùng. Không chỉ vậy, nhà sản xuất còn trang bị cơ chế tản nhiệt hiệu quả, giúp hiệu suất của máy duy trì xuyên suốt trong nhiều giờ liên tục mà không bị gián đoạn hay có tình trạng giật lag.</p><p class=\"ql-align-justify\"><br></p><p class=\"ql-align-center\">&nbsp;<img src=\"https://cdn.hoanghamobile.com/i/content/Uploads/2022/06/28/pro-m2-13-3.png\"></p><p class=\"ql-align-justify\">MacBook Pro M2 13 inch 2022 chính hãng cũng đi kèm với bộ nhớ lưu trữ lên tới 256GB. Người dùng có thể lưu lại các thông tin cần thiết cho công việc, học tập hoặc giải trí với những bộ phim mới nhất. Hai cạnh bên của máy là các cổng kết nối linh hoạt bao gồm USB Type-C, 2 cổng Thunderbolt 3, Jack cắm 3.5mm và kết nối không dây Wifi 6. Người dùng có thể dễ dàng kết nối, truyền xuất dữ liệu khi cần một cách nhanh chóng trên chiếc MacBook Pro M2 13 inch 2022 256GB chính hãng này. Đây là dòng máy tính phù hợp cho cả người dùng là học sinh, sinh viên hoặc dân văn phòng.</p><h3 class=\"ql-align-justify\">Trải nghiệm màn hình Rentina rực rỡ, sắc nét đến từng chi tiết</h3><p class=\"ql-align-justify\">Phiên bản MacBook Pro M2 13 inch 2022 256GB chính hãng được trang bị màn hình Retina cùng dải màu P3, mang lại chất lượng hiển thị sắc nét, chân thực và vô cùng sống động. Cùng với đó, Apple còn trang bị thêm công nghệ True Tone giúp điều chỉnh màu theo ánh sáng thực tế, để người dùng có trải nghiệm nhìn hình ảnh tự nhiên, rực rỡ nhất. Màn hình có kích thước 13 inch cùng thiết kế “tai thỏ” giúp tối ưu không gian hiển thị nội dung, sắc nét đến từng chi tiết.&nbsp;</p><p class=\"ql-align-justify\">Đặc biệt, máy tính còn được trang bị thêm camera FaceTime HD và micro chất lượng phòng thu. Giờ đây bạn có thể tham gia các cuộc họp hay cuộc gọi trực tuyến với chất lượng hình ảnh ổn định, đàm thoại rõ ràng không còn bị gián đoạn. MacBook Pro M2 13 inch 2022 256GB chính hãng cũng đi kèm với thời lượng pin lên tới 20 giờ để người dùng có thể thoải mái sử dụng trong suốt ngày dài.</p><p class=\"ql-align-justify\">Sản phẩm đang được bán trên hệ thống của Hoàng Hà Mobile với mức giá ưu đãi và chế độ bảo hành chính hãng 12 tháng. Tham khảo thông tin và đặt mua sản phẩm ngay hôm nay.&nbsp;</p><p><br></p>",
      "id": 11
    },
    {
      "name": "Samsung Galaxy S22 Ultra ",
      "price": 24000000,
      "categoryId": 3,
      "image": "http://res.cloudinary.com/dbo0o124i/image/upload/v1670345646/j005w5rcoipblfj4wg0w.png",
      "introduce": "Điểm nhấn của buổi ra mắt Samsung Galaxy S22 series chắc chắn là siêu phẩm Galaxy S22 Ultra. Đây là một trong những chiếc máy cao cấp nhất của Samsung, và đem lại cảm giác vô cùng thân thuộc với khách hàng, đặc biệt là những người đã từng sử dụng Galaxy Note.",
      "desc": "<p class=\"ql-align-justify\">Điểm nhấn của buổi ra mắt Samsung Galaxy S22 series chắc chắn là siêu phẩm Galaxy S22 Ultra. Đây là một trong những chiếc máy cao cấp nhất của Samsung, và đem lại cảm giác vô cùng thân thuộc với khách hàng, đặc biệt là những người đã từng sử dụng Galaxy Note.</p><h3>Thiết kế sang trọng và đầy mới lạ</h3><p class=\"ql-align-justify\">Samsung Galaxy S22 Ultra đơn giản nhưng đồng thời cũng tuyệt đẹp. Các góc cạnh của sản phẩm hoàn thiện sắc nét, vuông vắn. Cụm camera vuông như mọi năm đã biến mất, thay vào đó là một thiết kế đồng bộ camera với mặt lưng. Chúng phẳng hơn và liền lạc, tổng thể là đơn giản nhưng đẹp mắt.</p><p class=\"ql-align-center\"><img src=\"https://admin.hoanghamobile.com/Uploads/2022/02/17/samsung-galaxy-s22-ultra.png\"></p><p class=\"ql-align-justify\"><br></p><p class=\"ql-align-justify\">Cảm giác cầm trên S22 Ultra đều cực kỳ thoải mái và dễ chịu, chắc tay. Các phần tiếp xúc giữa 2 vật liệu là nhôm gia cường và kính ở mặt lưng, màn hình đều rất chỉn chu. Vị trí giữa phần viền hông và phần cạnh đáy cũng được gia công đủ khéo để khi dùng máy 1 tay, tì vào lòng bàn tay không có cảm giác khó chịu. Giống như những đời siêu phẩm trước, Galaxy S22 Ultra cũng có khả năng kháng nước và bụi bẩn IP68.</p><h3>Hiệu năng khủng với Snapdragon 8 Gen1. Bút Spen trở lại!</h3><p class=\"ql-align-justify\">Khác với những năm trước, Samsung đã trang bị hẳn cho thị trường Việt Nam con chipset mạnh nhất nhà Qualcomm hiện tại là Snapdragon 8 Gen1.Tiến trình 4nm của con chip mới này không chỉ giúp tiết kiệm điện năng, mà còn đẩy mạnh tốc độ xử lý.&nbsp;Qualcomm tuyên bố hiệu năng CPU của Snapdragon 8 Gen1 sẽ mạnh hơn 20%, trong khi tiết kiệm điện hơn 30% so với Snapdragon 888. Snapdragon 8 Gen1 tích hợp đầy đủ 5G, WiFi 6 và 6E.&nbsp;Máy sẽ có tùy chọn bộ nhớ 128GB/8GB RAM, 256GB/12GB RAM, 512GB/16GB RAM, 1TB/16GB RAM.</p><p class=\"ql-align-center\"><img src=\"https://admin.hoanghamobile.com/Uploads/2022/02/17/samsung-galaxy-s22-ultra-2.png\"></p><p class=\"ql-align-justify\"><br></p><p class=\"ql-align-justify\">Chúng ta cũng được chào đón bút Spen thần thánh trở lại. Đặc sản riêng có của dòng Note là bút S Pen cùng khe cắm bút tích hợp sẵn trong thân máy cũng có mặt trên S22 Ultra. Chúng ta sẽ không cần phải trang bị những chiếc ốp chỉ để đựng bút như trên S21 Ultra nữa. Nói cách khác, S22 Ultra gần như một chiếc Note được làm mới.</p><h3>Màn hình lớn trải nghiệm cực đỉnh, độ sáng đỉnh tới 1750 nit</h3><p class=\"ql-align-justify\">Phần viền màn hình Galaxy S22 Ultra được làm siêu mỏng tạo nên trải nghiệm màn hình “vô cực”. Cảm biến vân tay siêu âm được đặt trong màn hình. Samsung khẳng định S22 Ultra là chiếc smartphone Galaxy có màn hình sáng nhất hiện nay, đỉnh sáng lên đến 1750 nit và độ sáng thông thường cũng đạt khoảng 1330 nit. Chiếc máy được trang bị màn hình Dynamic AMOLED 2X với kích thước 6.8 inch hỗ trợ độ phân giải Quad HD+, tần số quét 120Hz, mật độ điểm ảnh 500 ppi.</p><p class=\"ql-align-justify\">Samsung cũng cho phép người dùng một tùy chọn là tốc độ quét thích ứng để hệ thống tự động điều chỉnh theo những nội dung đang hiển thị trên màn hình. Với thông số như vậy, cảm giác giải trí không ngoài 2 chữ “tuyệt vời”. Phản hồi xúc giác vuốt chạm là gần như không có độ trễ, xứng đáng là siêu phẩm hàng đầu!</p><p class=\"ql-align-center\"><img src=\"https://admin.hoanghamobile.com/Uploads/2022/02/17/samsung-galaxy-s22-ultra-3.png\"></p><p class=\"ql-align-justify\"><br></p><h3>Camera sẽ trang bị công nghệ điểm ảnh mới, chụp đêm tốt hơn tới 23%</h3><p class=\"ql-align-justify\">&nbsp;</p><p class=\"ql-align-justify\">Về camera, dù có thiết kế mới nhưng các thông số camera của S22 Ultra tương đồng như S21 Ultra. Máy sẽ có 4 camera và 1 cảm biến laser hỗ trợ lấy nét lần lượt gồm: Camera chính 108 MP, camera góc siêu rộng 12MP, camera tele 1 độ phân giải 10MP, Camera tele 2 độ phân giải 10MP. Phía trước là camera selfie 40 MP.</p><p class=\"ql-align-center\"><img src=\"https://admin.hoanghamobile.com/Uploads/2022/02/17/samsung-galaxy-s22-ultra-4.png\"></p><p class=\"ql-align-justify\"><br></p><p class=\"ql-align-justify\">Samsung tuyên bố S22 Ultra được trang bị công nghệ gộp điểm ảnh mới, có thể tạo ra điểm ảnh lớn 2.4 micron, giúp quay chụp trong đêm sáng hơn 23%. Khả năng quay video chống rung OIS góc rộng cũng tốt hơn 58%. Samsung cho biết hãng đã áp dụng một loạt công nghệ AI mới để cải thiện chất lượng ảnh và video chân dung, trang bị tính năng chân dung ban đêm giúp chụp chân dung xóa phông cả trong điều kiện cực kỳ thiếu sáng.</p><p class=\"ql-align-justify\">Galaxy S22 Ultra còn được trang bị công nghệ AI mới nhất của Samsung góp phần nâng tầm ảnh chụp của người dùng lên một tầm cao mới. Người dùng sẽ có thể dễ dàng có được những bức ảnh hoàn hảo ở Chế độ Chân dung nhờ tính năng AI Stereo Depth Map mới, với những chi tiết nhỏ nhất đều sẽ hiển thị sắc nét và rõ ràng nhờ thuật toán AI tinh vi.</p><p><br></p>",
      "id": 12
    },
    {
      "name": "Xiaomi 12 Pro",
      "price": 21000000,
      "categoryId": 5,
      "image": "http://res.cloudinary.com/dbo0o124i/image/upload/v1670345698/a8vodxc9tsxq9bbtdaoy.png",
      "introduce": "Xiaomi một lần nữa đã khẳng định vị trí của hãng trong phân khúc dòng sản phẩm điện thoại thông minh cao cấp với Xiaomi 12 Pro - là một sự nâng cấp hoàn chỉnh từ diện mạo thiết kế bên ngoài đến hiệu năng mạnh mẽ bên trong. ",
      "desc": "<p class=\"ql-align-justify\"><strong style=\"color: rgb(0, 0, 0); background-color: transparent;\">Thiết kế</strong><span style=\"color: rgb(0, 0, 0); background-color: transparent;\"> </span><strong style=\"color: rgb(0, 0, 0); background-color: transparent;\">tiên phong chuẩn chất “Pro”&nbsp;</strong></p><p class=\"ql-align-justify\"><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Điện thoại cao cấp Xiaomi 12 Pro với kích thước lần lượt là 163.60x 74.60 x 8.16mm và trọng lượng 205g, các góc cạnh của điện thoại được thiết kế theo hướng bo tròn vô cùng mượt mà, tinh tế đem lại cảm giác mượt mịn trên tay. Ba màu sắc rực rỡ đi kèm với Xiaomi 12 Pro đó là xanh dương, tím và xám tạo nên sự mới mẻ và gây được ấn tượng nổi bật đầu tiên với bất kỳ ai sử dụng chúng.&nbsp;</span></p><p class=\"ql-align-justify\"><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Mặt trước của sản phẩm là màn hình 120Hz được trang bị kính cường lực Corning Gorilla Victus để tránh va đập. Trong khi mặt sau nổi bật là cụm camera đặc trưng được làm bằng kim loại cao cấp thu hút mọi ánh mắt của người đối diện. Nhìn chung, Xiaomi đã thành công trong việc nâng tầm một flagship chuẩn chất hiện đại, làm tô điểm phong cách cho mọi đối tượng đang sở hữu chúng.&nbsp;</span></p><p class=\"ql-align-justify\"><img src=\"https://cdn.hoanghamobile.com/i/content/Uploads/2022/03/23/picture1-1.png\"></p><p class=\"ql-align-justify\"><strong style=\"color: rgb(0, 0, 0); background-color: transparent;\">Nổi bật với màn hình 6.73” đạt chứng nhận DisplayMate A+&nbsp;</strong></p><p class=\"ql-align-justify\"><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Điện thoại thông minh được trang bị màn hình 6.73 inch có thể điều chỉnh thông minh màn hình LTPO dao động trong khoảng từ 1Hz đến 120Hz dựa trên nội dung trên máy. Xiaomi 12 đã đạt kỷ lục về chất lượng màn hình nhiều màu sắc nhất của smartphone hãng cho đến nay, với hơn 68 tỷ màu trên màn hình 6,28 inch full-HD +. Tính năng AdaptiveSync 120Hz cho màn hình hiển thị có độ phân giải cao, sống động và không nhấp nháy, truyền tải mọi chi tiết một cách ấn tượng.&nbsp;</span></p><p class=\"ql-align-justify\"><img src=\"https://cdn.hoanghamobile.com/i/content/Uploads/2022/03/23/p2.jpg\"></p><p class=\"ql-align-justify\"><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Màn hình của Xiaomi 12 Pro sử dụng vật liệu AMOLD E5 hàng đầu giúp nâng cao độ sáng và độ tương phản trên màn hình và giảm 25% yêu cầu về điện năng. Công nghệ vi thấu kính được thêm vào phía trên lớp điểm ảnh để nâng cao hiệu quả phát xạ ánh sáng, đồng thời giảm đáng kể mức tiêu thụ điện năng.</span></p><p class=\"ql-align-justify\"><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Chứng chỉ SGS Eye Care Display được trang bị trên sản phẩm Xiaomi 12 Pro khẳng định thêm về sự ước nguyện của hãng Xiaomi trong việc cải thiện sức khỏe thị giác của người tiêu dùng, hỗ trợ ngăn ngừa bị đau hoặc mỏi mắt trong suốt quá trình trải nghiệm sử dụng.&nbsp;</span></p><p class=\"ql-align-justify\"><br></p><p class=\"ql-align-justify\"><strong style=\"color: rgb(0, 0, 0); background-color: transparent;\">Bứt phá mọi giới hạn hiệu năng cùng vi xử lý Snapdragon 8 Gen 1</strong></p><p class=\"ql-align-justify\"><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Xiaomi 12 Pro sử dụng Snapdragon 8 Gen 1 với tiến trình 4nm mang trong mình nhiều cải tiến vượt trội với khả năng kiểm soát điện năng linh hoạt và tỏa ít nhiệt hơn. Vi xử lý chứa GPU Qualcomm Adreno cho thấy khả năng dựng hình đáng ngạc nhiên của cấu trúc mới, tốc độ dựng hình vượt trội hơn 30% so với thế hệ chip cũ. Công nghệ Qualcomm® AI Engine thế hệ thứ 7 đem lại tốc độ hợp nhất AI nhanh hơn mang lại khả năng xử lý tín hiệu hình ảnh thông minh hơn.</span></p><p class=\"ql-align-justify\"><span style=\"color: rgb(0, 0, 0); background-color: transparent;\">Xiaomi 12 Pro còn hứa hẹn đem lại cho bạn hệ thống làm mát tiên tiến có buồng hơi siêu mỏng với diện tích 2.900 mm², lớn hơn đáng kể so với các loại tản nhiệt khác từ trước đến nay, cùng ba lớp graphit cực lớn để giảm nhiệt độ lõi một cách hiệu quả. Kết hợp với hệ thống âm thanh đỉnh cao với bốn loa – hai loa cao và hai loa trầm, cung cấp mọi thứ bạn cần để đắm chìm trong những tuyệt tác âm nhạc.</span></p><p class=\"ql-align-justify\"><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">&nbsp;</span><img src=\"https://cdn.hoanghamobile.com/i/content/Uploads/2022/03/23/p3.png\"></p><p class=\"ql-align-justify\"><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Để tối ưu hóa trải nghiệm người dùng hơn nữa, Xiaomi 12 Pro sẽ chạy trên hệ điều hành MIUI 13, bản cập nhật bao gồm bộ nhớ nhanh hơn, hiệu suất xử lý nền cao hơn, khả năng xử lý thông minh hơn và tuổi thọ pin dài hơn. Các tính năng mới trong trải nghiệm được nâng cấp bao gồm công nghệ cốt lõi của Xiaomi như Liquid Storage, Atomized Memory, Focused Algorithms, và Smart Balance.</span></p><p class=\"ql-align-justify\"><strong style=\"background-color: transparent; color: rgb(0, 0, 0);\">Trải nghiệm chụp ảnh và ghi hình đúng chất điện ảnh cao cấp</strong></p><p class=\"ql-align-justify\"><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Xiaomi 12 Pro sử dụng camera góc rộng 50MP IMX707, khẩu độ f/1.9 hỗ trợ người dùng trải nghiệm quay phim 8K, quay phim 4K HDR 10+, Ultra Night Video, One-click AI cinema, Xiaomi ProFocus (Lấy nét theo dõi chuyển động/ Chụp chuyển động/ Lấy nét theo dõi mắt), chế độ Ultra Night Photo (chụp chân dung ban đêm nâng cao)&nbsp; và Portrait Night (chụp ảnh chân dung ban đêm)&nbsp;</span></p><p class=\"ql-align-justify\"><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Trong khi đó, camera góc siêu rộng 50MP&nbsp; đem đến trường nhìn 115°, khẩu độ f/2.2&nbsp; kết hợp cùng camera tele 50MP tiêu cự tương đương 48mm (khẩu độ f/1.9) hỗ trợ chế độ chụp ảnh ban đêm ban đêm và chế độ 50MP. Ở đằng trước là camera selfie trong màn hình 32MP khẩu độ f/2.45, tiêu cự 1.4μm 4-in-1 Super Pixel giúp quay phim HDR 10+, chế độ Selfie Ban đêm và video chân dung AI.&nbsp;</span></p><p class=\"ql-align-justify\"><img src=\"https://cdn.hoanghamobile.com/i/content/Uploads/2022/03/23/p4.jpg\"></p><p class=\"ql-align-justify\"><strong style=\"color: rgb(0, 0, 0); background-color: transparent;\">Công nghệ sạc thế hệ mới kết hợp cùng pin trâu 4600mAh&nbsp;</strong></p><p class=\"ql-align-justify\"><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Pin 4,600mAh cực khủng của Xiaomi có thể dùng kèm với sạc dây 120W, sạc không dây 50W turbo và sạc ngược không dây 10W. Theo tuyên bố từ Xiaomi thì điện thoại có thể trụ được hơn 5 giờ khi quay video ở độ phân giải 1080p, 9 tiếng lướt web, 15 giờ truyền phát video liên tục và 19 giờ đàm thoại thoải mái.&nbsp;</span></p><p class=\"ql-align-justify\"><img src=\"https://cdn.hoanghamobile.com/i/content/Uploads/2022/03/23/p45.png\"></p><p class=\"ql-align-justify\"><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Để kéo dài tuổi thọ pin và đảm bảo sạc an toàn, công nghệ Xiaomi AdaptiveCharge sẽ làm quen với thói quen sạc pin vào ban đêm của bạn. Máy sẽ dừng sạc ở mức 80% trong khi bạn ngủ và sẽ tiếp tục sạc đầy ngay trước khi bạn bắt đầu ngày mới.</span></p><p><br></p>",
      "id": 13
    }
  ],
  "categorys": [
    {
      "id": 1,
      "name": "Iphone",
      "image": "http://res.cloudinary.com/dbo0o124i/image/upload/v1669796052/apgbhwysnjrtac7metzb.jpg"
    },
    {
      "id": 2,
      "name": "Laptop",
      "image": "http://res.cloudinary.com/dbo0o124i/image/upload/v1669796145/guwtyiomy0wn7qdjul4n.jpg"
    },
    {
      "id": 3,
      "name": "SamSung",
      "image": "http://res.cloudinary.com/dbo0o124i/image/upload/v1669796163/mmyq0qxijdywwviagkot.jpg"
    },
    {
      "id": 5,
      "name": "Xiaomi",
      "image": "http://res.cloudinary.com/dbo0o124i/image/upload/v1669796341/zain515booc7wmrffeic.png"
    },
    {
      "name": "Tai nghe",
      "image": "http://res.cloudinary.com/dbo0o124i/image/upload/v1669796190/q5ycdb47de389slyzcdz.jpg",
      "id": 6
    }
  ],
  "users": [
    {
      "email": "nam@123.com",
      "password": "$2a$10$TUFkHMjUo16pkZ9MZYCOG.wj.jSfUNZJ0Kd2/FKi/3Y8QdSZlxUGy",
      "username": "Hoàng Nam",
      "role": "admin",
      "image": "https://ui-avatars.com/api/?uppercase=true&name=Hoàng Nam&background=336699&size=500",
      "id": 1
    },
    {
      "email": "nam@1234.com",
      "password": "$2a$10$T9pW.T1hDz1PgsAOSinJkeQGe4K6avDJlaOLBSEcD7xis39J08OEe",
      "username": "Hoàng Nam",
      "role": "user",
      "image": "https://ui-avatars.com/api/?uppercase=true&name=Hoàng Nam&background=009900&size=500",
      "id": 2
    },
    {
      "email": "123@gmail.com",
      "password": "$2a$10$vENFkor0AGc1fKV5c9HU5.bSmRA2lgQE4YLs38wW0YjYOl66qlWry",
      "username": "Hoàng Nam",
      "role": "user",
      "image": "https://ui-avatars.com/api/?uppercase=true&name=Hoàng Nam&background=336666&size=500",
      "id": 3
    }
  ],
  "checkouts": [
    {
      "username": "Hoàng Nam",
      "address": "Ha Noi",
      "phone": "0123456789",
      "email": "nam@123.com",
      "cart": {
        "order": [
          {
            "name": "Iphone 13 Pro Max",
            "price": 20000000,
            "categoryId": 1,
            "image": "http://res.cloudinary.com/chanh-thon/image/upload/v1669565936/upload_preset/drnrypjzdepu01am2jag.jpg",
            "desc": "<p>hay</p>",
            "id": 5,
            "quantity": 3
          },
          {
            "id": 6,
            "name": "Apple Watch serri 10",
            "price": 8000000,
            "categoryId": 1,
            "image": "http://res.cloudinary.com/chanh-thon/image/upload/v1669568270/upload_preset/m7au3ogr9vxpqpcjrnd6.png",
            "desc": "<p>hahaha</p>",
            "quantity": 2
          },
          {
            "id": 7,
            "name": "Iphone 13 Pro Max",
            "price": 25000000,
            "categoryId": 1,
            "image": "http://res.cloudinary.com/dbo0o124i/image/upload/v1669619844/fd6qsvqbdwugtkuwfxek.jpg",
            "desc": "<p>hay</p>",
            "quantity": 2
          }
        ],
        "totalPrice": 126000000
      },
      "status": 2,
      "id": 1
    },
    {
      "username": "Hoàng Nam",
      "address": "Ha Noi",
      "phone": "123456",
      "email": "nam@123.com",
      "cart": {
        "order": [
          {
            "name": "Iphone 13 Pro Max",
            "price": 20000000,
            "categoryId": 1,
            "image": "http://res.cloudinary.com/chanh-thon/image/upload/v1669565936/upload_preset/drnrypjzdepu01am2jag.jpg",
            "desc": "<p>hay</p>",
            "id": 5,
            "quantity": 2
          },
          {
            "name": "Xiaomi Black Shark 4 Pro",
            "price": 20000000,
            "categoryId": 5,
            "image": "http://res.cloudinary.com/dbo0o124i/image/upload/v1670226867/fdvwpf4z4eleuakymtpc.jpg",
            "desc": "<p>máy này chơi game maxping hay</p>",
            "id": 9,
            "quantity": 6
          }
        ],
        "totalPrice": 160000000
      },
      "status": 3,
      "id": 2
    },
    {
      "username": "Hoàng Nam",
      "address": "Ha Noi",
      "phone": "0123456789",
      "email": "nam@123.com",
      "cart": {
        "order": [
          {
            "id": 6,
            "name": "Apple Watch serri 10",
            "price": 8000000,
            "categoryId": 1,
            "image": "http://res.cloudinary.com/chanh-thon/image/upload/v1669568270/upload_preset/m7au3ogr9vxpqpcjrnd6.png",
            "desc": "<p>hahaha</p>",
            "quantity": 3
          },
          {
            "id": 7,
            "name": "Iphone 13 Pro Max",
            "price": 25000000,
            "categoryId": 1,
            "image": "http://res.cloudinary.com/dbo0o124i/image/upload/v1669619844/fd6qsvqbdwugtkuwfxek.jpg",
            "desc": "<p>hay</p>",
            "quantity": 4
          }
        ],
        "totalPrice": 124000000
      },
      "status": 1,
      "id": 3
    }
  ]
}